[
  {
    "id": 1,
    "title": "Software Engineer",
    "description": "Design, develop, and maintain software applications and systems.",
    "fullDescription": "Software engineers are responsible for the entire software development lifecycle, from initial concept to deployment and maintenance. They work with various programming languages, frameworks, and tools to create efficient, scalable, and user-friendly applications. This role requires strong problem-solving skills, attention to detail, and the ability to work collaboratively in team environments.",
    "skills": ["JavaScript", "Python", "React", "Node.js", "SQL", "Git"],
    "educationalPath": "Bachelor's in Computer Science or related field",
    "salaryRange": "$70k–$150k / year",
    "industry": "Technology",
    "image": "dist/images/Software Engineer.jpg?height=200&width=300"
  },
  {
    "id": 2,
    "title": "Registered Nurse",
    "description": "Provide patient care and support in healthcare settings.",
    "fullDescription": "Registered nurses play a crucial role in healthcare delivery, providing direct patient care, administering medications, monitoring patient conditions, and educating patients and families about health management. They work in various settings including hospitals, clinics, schools, and community health centers, requiring strong communication skills, empathy, and clinical expertise.",
    "skills": ["Patient Care", "Medical Knowledge", "Communication", "Critical Thinking", "EMR Systems"],
    "educationalPath": "Associate or Bachelor's in Nursing + RN License",
    "salaryRange": "$60k–$110k / year",
    "industry": "Healthcare",
    "image": "dist/images/Registered Nurse .jpg?height=200&width=300"
  },
  {
    "id": 3,
    "title": "Marketing Manager",
    "description": "Develop and execute marketing strategies to promote products and services.",
    "fullDescription": "Marketing managers oversee marketing campaigns, analyze market trends, and develop strategies to increase brand awareness and drive sales. They coordinate with creative teams, manage budgets, and use data analytics to measure campaign effectiveness. This role requires creativity, analytical skills, and strong project management abilities.",
    "skills": ["Digital Marketing", "Analytics", "Content Strategy", "SEO", "Social Media", "Project Management"],
    "educationalPath": "Bachelor's in Marketing, Business, or Communications",
    "salaryRange": "$55k–$120k / year",
    "industry": "Business",
    "image": "dist/images/1.jpg?height=200&width=300"
  },
  {
    "id": 4,
    "title": "Elementary Teacher",
    "description": "Educate and inspire young learners in foundational subjects.",
    "fullDescription": "Elementary teachers create engaging learning environments for students in grades K-6, developing lesson plans, assessing student progress, and fostering social and emotional development. They collaborate with parents, administrators, and support staff to ensure student success and create inclusive classrooms that accommodate diverse learning needs.",
    "skills": ["Curriculum Development", "Classroom Management", "Communication", "Patience", "Technology Integration"],
    "educationalPath": "Bachelor's in Education + Teaching License",
    "salaryRange": "$40k–$75k / year",
    "industry": "Education",
    "image": "dist/images/Elementary Teacher.jpg?height=200&width=300"
  },
  {
    "id": 5,
    "title": "Graphic Designer",
    "description": "Create visual content for digital and print media.",
    "fullDescription": "Graphic designers combine art and technology to communicate ideas through visual content. They work on projects ranging from logos and branding to websites and marketing materials, using design software and creative thinking to solve visual communication problems. This role requires artistic skills, technical proficiency, and understanding of design principles.",
    "skills": ["Adobe Creative Suite", "Typography", "Branding", "UI/UX Design", "Print Design", "Color Theory"],
    "educationalPath": "Bachelor's in Graphic Design or Fine Arts",
    "salaryRange": "$35k–$85k / year",
    "industry": "Arts",
    "image": "dist/images/Graphic Designer.jpg?height=200&width=300"
  },
  {
    "id": 6,
    "title": "Data Scientist",
    "description": "Analyze complex data to extract insights and drive business decisions.",
    "fullDescription": "Data scientists use statistical analysis, machine learning, and programming to extract meaningful insights from large datasets. They work closely with business stakeholders to identify opportunities, build predictive models, and communicate findings through visualizations and reports. This role requires strong analytical skills, programming expertise, and business acumen.",
    "skills": ["Python", "R", "SQL", "Machine Learning", "Statistics", "Data Visualization"],
    "educationalPath": "Bachelor's/Master's in Data Science, Statistics, or Computer Science",
    "salaryRange": "$80k–$160k / year",
    "industry": "Technology",
    "image": "dist/images/Data Scientist.jpg?height=200&width=300"
  },
  {
    "id": 7,
    "title": "Physical Therapist",
    "description": "Help patients recover from injuries and improve mobility.",
    "fullDescription": "Physical therapists evaluate and treat patients with movement disorders, injuries, or disabilities. They develop personalized treatment plans, use therapeutic exercises and techniques, and educate patients on injury prevention. This role requires strong interpersonal skills, physical stamina, and detailed knowledge of human anatomy and movement.",
    "skills": ["Anatomy Knowledge", "Manual Therapy", "Exercise Prescription", "Patient Assessment", "Communication"],
    "educationalPath": "Doctorate in Physical Therapy + License",
    "salaryRange": "$75k–$120k / year",
    "industry": "Healthcare",
    "image": "dist/images/Physical Therapist.jpg?height=200&width=300"
  },
  {
    "id": 8,
    "title": "Financial Analyst",
    "description": "Analyze financial data to guide investment and business decisions.",
    "fullDescription": "Financial analysts research economic and business trends, examine financial statements, and provide recommendations for investments or business strategies. They create financial models, prepare reports, and present findings to management or clients. This role requires strong analytical skills, attention to detail, and knowledge of financial markets.",
    "skills": ["Financial Modeling", "Excel", "Data Analysis", "Research", "Presentation", "Risk Assessment"],
    "educationalPath": "Bachelor's in Finance, Economics, or Business",
    "salaryRange": "$60k–$130k / year",
    "industry": "Business",
    "image": "dist/images/Financial Analyst.jpg?height=200&width=300"
  },
  {
    "id": 9,
    "title": "Civil Engineer",
    "description": "Design and oversee construction of infrastructure projects.",
    "fullDescription": "Civil engineers plan, design, and supervise the construction of infrastructure projects such as roads, bridges, buildings, and water systems. They ensure projects meet safety standards, environmental regulations, and budget constraints while coordinating with contractors, government agencies, and other stakeholders.",
    "skills": ["AutoCAD", "Project Management", "Structural Analysis", "Construction Knowledge", "Problem Solving"],
    "educationalPath": "Bachelor's in Civil Engineering + PE License",
    "salaryRange": "$65k–$125k / year",
    "industry": "Government",
    "image": "dist/images/Civil Engineer.jpg?height=200&width=300"
  },
  {
    "id": 10,
    "title": "UX Designer",
    "description": "Design user-centered digital experiences and interfaces.",
    "fullDescription": "UX designers research user needs, create wireframes and prototypes, and design intuitive digital experiences. They conduct user testing, collaborate with developers and product managers, and iterate on designs based on feedback and data. This role requires empathy, creativity, and understanding of human-computer interaction principles.",
    "skills": ["User Research", "Wireframing", "Prototyping", "Figma", "Usability Testing", "Information Architecture"],
    "educationalPath": "Bachelor's in Design, Psychology, or related field",
    "salaryRange": "$70k–$140k / year",
    "industry": "Technology",
    "image": "dist/images/UX Designer.jpg?height=200&width=300"
  }
]
